<div id="test">
<h2>Исходные данные:</h2>

<p>Есть отчет в виде таблицы. Это список сделок. Каждая сделка приносит либо прибыль,
    либо убыток и влияет на сумму баланса.</p>

<h2>Задача:</h2>

<p>Написать скрипт на php (на yii2, если вы его знаете), который парсит отчет со сделками (см. вложение) и
показывает результат объединения в виде графика роста баланса в зависимости от каждой операции.
    Предусмотреть возможность загрузки любого подобного файла и построения по загруженным данным нового графика.</p>

<p>Хотя это тестовое задание, проверять его мы будем, как полноценное приложение.
    Логика приложения несложная, поэтому сделайте его максимально продуманным и интерактивным с вашей точки зрения.</p>

